---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.SystemId
source: html/17943658-b26e-f781-0aee-df60b5e8cfbe.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.SystemId Property

The Id of an AreaReinforcement or PathReinforcement element that owns
 this element.

## Syntax (C#)
```csharp
public ElementId SystemId { get; }
```